app/controllers/users_controller.rb

INSERT INTO "users" ("email", "created_at", "updated_at") VALUES (?, ?, ?)  [["email", "yourmom@mom.com"], ["created_at", "2021-01-16 00:34:14.174087"], ["updated_at", "2021-01-16 00:34:14.174087"]]
---
  def create
    @user = User.new(user_params)
    # byebug
    if @user.save

UPDATE "users" SET "monthly_income" = ?, "monthly_bills" = ?, "leftover_money" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["monthly_income", 3000], ["monthly_bills", 1000], ["leftover_money", 2000], ["updated_at", "2021-01-18 20:01:22.876182"], ["id", 64]]
---
  def update
    # byebug
    if @user.update(user_params)